# https://github.com/homebrew/homebrew-bundle

tap "dart-lang/dart"
tap "homebrew-ffmpeg/ffmpeg"
tap "sass/sass"

brew "ansible"
brew "blueutil"
brew "closure-compiler"
brew "dart-lang/dart/dart"
brew "dnsmasq", restart_service: true
brew "homebrew-ffmpeg/ffmpeg/ffmpeg", args: ["with-fdk-aac"]
brew "gifsicle"
brew "git"
brew "httpd", restart_service: true
brew "imagemagick"
brew "mariadb", restart_service: true
brew "mcrypt"
brew "moreutils"
brew "node"
brew "php", restart_service: true
brew "phpmyadmin"
brew "pipx"
brew "postgresql", restart_service: true
brew "python"
brew "rbenv"
brew "rsync"
brew "sass/sass/sass"
brew "ssh-copy-id"
brew "svgo"
brew "telnet"
brew "the_silver_searcher"
brew "watch"
brew "wget"
brew "wp-cli"
brew "youtube-dl"

cask "docker"
cask "vagrant"
cask "virtualbox"
cask "java"
