# https://github.com/homebrew/homebrew-bundle

tap "dart-lang/dart"
tap "homebrew-ffmpeg/ffmpeg"
tap "mutagen-io/mutagen"
tap "sass/sass"
tap "yt-dlp/taps"

brew "atomicparsley" # https://github.com/yt-dlp/yt-dlp#dependencies
brew "blueutil"
brew "closure-compiler"
brew "dart-lang/dart/dart"
brew "dnsmasq", restart_service: true
brew "homebrew-ffmpeg/ffmpeg/ffmpeg", args: ["with-fdk-aac"]
brew "fontforge"
brew "gifsicle"
brew "git"
brew "httpd", restart_service: true
brew "imagemagick"
brew "mariadb", restart_service: true
brew "media-info"
brew "mcrypt"
brew "moreutils"
brew "mutagen-io/mutagen/mutagen" # https://github.com/yt-dlp/yt-dlp#dependencies
brew "node"
brew "php", restart_service: true
brew "phpmyadmin"
brew "pipx"
brew "postgresql@14", restart_service: true
brew "python"
brew "rbenv"
brew "restic"
brew "rsync"
brew "sass/sass/sass"
brew "ssh-copy-id"
brew "svgo"
brew "telnet"
brew "the_silver_searcher"
brew "watch"
brew "wget"
brew "wp-cli"
brew "yt-dlp/taps/yt-dlp"

cask "android-platform-tools"
# cask "docker"
# cask "vagrant"
# cask "virtualbox"
# cask "java"
cask "rar"
cask "sequel-ace"
cask "google-cloud-sdk"
cask "qlvideo"
